/* Задача. Напишите программу, которая считает в обаратном
направлении от 99 до 0 через 3 и выводит каждое число. Если
текущее число кратно 5, то программа также выводит сообщение
"Found one!".*/

#include <stdio.h>
int main (void)

// Делаем пошагово.

// Шаг 1. Выводим все числа от 99 до 0.

//{
//    for (int i = 99; i >= 0; i--) {
//        printf("%d\n", i);
//    }
//    return 0;
//}

// Шаг 2. Выводим все числа от 99 до 0 через 3.

//{
//    for (int i = 99; i >= 0; i--) {
//        if (i % 3 == 0)
//        printf("%d\n", i);
//    }
//
//    return 0;
//}

// Шаг 3. Выводим все числа от 99 до 0 через 3. Отмечать числа, кратные 5.

{
    for (int i = 99; i >= 0; i--) {
        if (i % 3 == 0) {
            printf("%d\n", i);
            if (i % 5 == 0) {
                printf("Found one!\n");
            }
        }
    }
    return 0;
}
